Catalogs/ЗадачиПроектовСтруктура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ЗадачиПроектовСтруктура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Закрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаннийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийСтарт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозднийФиниш</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суммарная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Comment>Для загрузки из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченияРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическийПуть</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетаСрокаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаСрокаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мощность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОграниченияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОграниченияРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакМожноРаньше</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакМожноПозже</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеПозднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеНеРанее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеНачало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированноеОкончание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРасчетаСрокаРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыРасчетаСрокаРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗадачеПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЗадачиПроектовСтруктура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РесурсыМощностьПриИзменении(Элемент)
	ТекДанные = Элементы.Ресурсы.ТекущиеДанные;
	ТекДанные.Количество = ТекДанные.Мощность * Объект.Продолжительность * 8; // 8 часов в рабочем дне
КонецПроцедуры


&НаСервереБезКонтекста
Функция ТарифнаяСтавкаИсполнителя(Исполнитель)
	Если ТипЗнч( Исполнитель ) = Тип("СправочникСсылка.Должности") Тогда
		Возврат Исполнитель.ТарифнаяСтавка;
		
		
	Иначе // физическое лицо
		Возврат УП_КадрыСервер.ТарифнаяСтавкаФизЛица( Исполнитель );
		
	КонецЕсли;
	Возврат Справочники.ТарифныеСтавки.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура РесурсыДолжностьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Ресурсы.ТекущиеДанные;
	ТекущиеДанные.ТарифнаяСтавка = ТарифнаяСтавкаИсполнителя(ТекущиеДанные.Исполнитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОграниченияПриИзменении(Элемент)
	УстановитьДоступностьСроков();
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьСроков()
	Элементы.РаннийФиниш.Доступность 	= Ложь;
	Элементы.ПозднийСтарт.Доступность 	= Ложь;
	Элементы.РаннийСтарт.Доступность 	= Ложь;
	Элементы.ПозднийФиниш.Доступность 	= Ложь;
	
	Если 		Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.КакМожноРаньше") Тогда
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.КакМожноПозже") Тогда
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.НачалоНеПозднее") Тогда
		Элементы.РаннийСтарт.Доступность 	= Истина;
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.НачалоНеРанее") Тогда
		Элементы.РаннийСтарт.Доступность 	= Истина;
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.ОкончаниеНеПозднее") Тогда
		Элементы.ПозднийФиниш.Доступность 	= Истина;
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.ОкончаниеНеРанее") Тогда
		Элементы.ПозднийФиниш.Доступность 	= Истина;
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.ФиксированноеНачало") Тогда
		Элементы.РаннийСтарт.Доступность 	= Истина;
		
	ИначеЕсли	Объект.ТипОграничения = ПредопределенноеЗначение("Перечисление.ТипыОграниченияРабот.ФиксированноеОкончание") Тогда
		Элементы.ПозднийФиниш.Доступность 	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьСроковРаботы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСроковРаботы()
	Если НЕ ЗначениеЗаполнено( Объект.ТипРасчетаСрокаРаботы ) Тогда
		Объект.ТипРасчетаСрокаРаботы = ПредопределенноеЗначение("Перечисление.ТипыРасчетаСрокаРабот.ПоЗадачеПроекта");
	КонецЕсли;
	
	Если Объект.ТипРасчетаСрокаРаботы = ПредопределенноеЗначение("Перечисление.ТипыРасчетаСрокаРабот.ПоЗадачеПроекта") Тогда
	
		ЭтаФорма.Элементы.ГруппаСрокиЗадачи.Видимость 				= Истина;
		ЭтаФорма.Элементы.ГруппаСрокиРаботы.Видимость 				= Ложь;
		ЭтаФорма.Элементы.ГруппаНастройкиРасчетаСроков.Видимость 	= Ложь;
	Иначе
		ЭтаФорма.Элементы.ГруппаСрокиЗадачи.Видимость 				= Ложь;
		ЭтаФорма.Элементы.ГруппаСрокиРаботы.Видимость 				= Истина;
		
		Если Объект.ТипРасчетаСрокаРаботы = ПредопределенноеЗначение("Перечисление.ТипыРасчетаСрокаРабот.Автоматически" ) Тогда
			ЭтаФорма.Элементы.ГруппаНастройкиРасчетаСроков.Видимость = Истина;
			
			УстановитьДоступностьСроков();
		Иначе
			ЭтаФорма.Элементы.ГруппаНастройкиРасчетаСроков.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ТипРасчетаСрокаРаботыПриИзменении(Элемент)
	УстановитьВидимостьСроковРаботы();
КонецПроцедуры
